app/confluence.yml
---
settings:
  artifacts-dir: results/confluence/%Y-%m-%d_%H-%M-%S
  aggregator: consolidator
  verbose: false
  check-updates: false                 # disable bzt check for updates
  env:
    application_hostname: a98e3638710f1468ab64b50cd0b93d33-1489266278.us-east-2.elb.amazonaws.com
    application_protocol: http         # http or https
    application_port: 80               # 80, 443, 8080, 1990, etc
    secure: True                       # Set False to allow insecure connections, e.g. when using self-signed SSL certificate
    application_postfix: /confluence   # Standard für AWS Terraform Deployment
    admin_login: admin
    admin_password: admin              # Standard AWS Dataset Passwort
    load_executor: locust              # jmeter and locust are supported. jmeter by default. Smartics uses locust.
    concurrency: 200                   # Enterprise: 200
    test_duration: 45m                 # Enterprise: 45m
    ramp-up: 5m                        # Enterprise: 5m
    total_actions_per_hour: 20000
    WEBDRIVER_VISIBLE: False
    JMETER_VERSION: 5.6.3
    LANGUAGE: en_US.utf8
    allow_analytics: Yes               # Allow sending basic run analytics to Atlassian. These analytics help us to understand how the tool is being used and help us to continue to invest in this tooling. For more details please see our README.
    environment_compliance_check: True  # Enterprise: aktiviert
    extended_metrics: False
    # Action percentage for JMeter and Locust load executors
    view_page: 33
    view_dashboard: 10
    view_blog: 13
    search_cql: 4
    create_blog: 5
    create_and_edit_page: 9
    comment_page: 8
    view_attachment: 6
    upload_attachment: 7
    like_page: 3
    upload_emoticon: 4      # For Confluence 8.4.x+
    standalone_extension: 0
    # Smartics custom test actions - ALL DISABLED for Run 1 & 2 (Performance Regression)
    # Enable for Run 3-5 (Scalability): set DM values to 6
    standalone_extension_us_rest_content: 0      # US
    standalone_extension_section: 0              # DM - Run 3-5: 6
    standalone_extension_hide: 0                 # DM - Run 3-5: 6
    standalone_extension_hidefromreader: 0       # DM - Run 3-5: 6
    standalone_extension_hidefromanonymous: 0    # DM - Run 3-5: 6
    standalone_extension_definitionlist: 0       # DM - Run 3-5: 6
    standalone_extension_transclude_documents: 0 # Toolbox - deaktiviert
    standalone_extension_display_table: 0        # Toolbox - deaktiviert
    standalone_extension_web_api: 0              # Toolbox - deaktiviert
    standalone_extension_information_system: 0   # IS - deaktiviert
    standalone_extension_blueprints: 0           # BP - deaktiviert
    # Custom dataset section.
    custom_dataset_query: title ~ 'MoreProjectdocUC'  # DM-Testseite im Space DCAPTUC
    local_chrome_binary_path:       # e.g. /usr/bin/google-chrome-stable. Leave it blank to use default Chrome binary path.

services:
  - module: shellexec
    prepare:
      - python util/pre_run/environment_checker.py
      - python util/pre_run/environment_compliance_check.py confluence
      - python util/data_preparation/confluence_prepare_data.py
    shutdown:
      - python util/post_run/jmeter_post_check.py
      - python util/jtl_convertor/jtls-to-csv.py kpi.jtl selenium.jtl
    post-process:
      - python util/analytics/analytics.py confluence
      - python util/post_run/cleanup_results_dir.py
  - module: pip-install
    packages:
      - selenium==4.27.1
execution:
  - scenario: ${load_executor}
    executor: ${load_executor}
    concurrency: ${concurrency}
    hold-for: ${test_duration}
    ramp-up: ${ramp-up}
  - scenario: selenium
    executor: selenium
    runner: pytest
    hold-for: ${test_duration}
scenarios:
  selenium:
    script: selenium_ui/confluence_ui.py
  locust:
    script: locustio/confluence/locustfile.py
  jmeter:
    script: jmeter/confluence.jmx
    properties:
      application_hostname: ${application_hostname}
      application_protocol: ${application_protocol}
      application_port: ${application_port}
      application_postfix: ${application_postfix}
      # Workload model
      total_actions_per_hr: ${total_actions_per_hour}
      perc_view_page: ${view_page}
      perc_view_dashboard: ${view_dashboard}
      perc_view_blog: ${view_blog}
      perc_search_cql: ${search_cql}
      perc_create_blog: ${create_blog}
      perc_create_and_edit_page: ${create_and_edit_page}
      perc_comment_page: ${comment_page}
      perc_view_attachment: ${view_attachment}
      perc_upload_attachment: ${upload_attachment}
      perc_like_page: ${like_page}
      perc_upload_emoticon: ${upload_emoticon}
      perc_standalone_extension: ${standalone_extension}
modules:
  consolidator:
    rtimes-len: 0 # CONFSRVDEV-7631 reduce sampling
    percentiles: [] # CONFSRVDEV-7631 disable all percentiles due to Taurus's excessive memory usage
  jmeter:
    version: ${JMETER_VERSION}
    detect-plugins: true
    memory-xmx: 8G  # allow JMeter to use up to 8G of memory
    plugins:
      - jpgc-casutg=2.10
      - jpgc-dummy=0.4
      - jpgc-ffw=2.0
      - jpgc-fifo=0.2
      - jpgc-functions=2.2
      - jpgc-json=2.7
      - jpgc-perfmon=2.1
      - jpgc-prmctl=0.4
      - jpgc-tst=2.6
      - bzm-random-csv=0.8    # not used default jmx file
    system-properties:
      server.rmi.ssl.disable: true
      java.rmi.server.hostname: localhost
      httpsampler.ignore_failed_embedded_resources: "true"
  selenium:
    chromedriver:
      version: "143.0.7499.192" # Supports Chrome version 143. You can refer to https://googlechromelabs.github.io/chrome-for-testing
reporting:
- data-source: sample-labels
  module: junit-xml
- module: passfail
  criteria:
  - failures>25% over 300s, stop as failed